README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
    <head>
        <title>README</title>
        <!-- 2014-10-28 Tue 11:46 -->
        <meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
        <meta  name="generator" content="Org-mode" />
        <meta  name="author" content="Tienson Qin" />
    </head>
    <body>
        <div id="content">
            <h1 class="title">README</h1>
            <div id="table-of-contents">
                <h2>Table of Contents</h2>
                <div id="text-table-of-contents">
                    <ul>
                        <li><a href="#sec-1">1. Hacked riak</a>
                        <ul>
                            <li><a href="#sec-1-1">1.1. Build</a></li>
                            <li><a href="#sec-1-2">1.2. Start</a></li>
                            <li><a href="#sec-1-3">1.3. Test</a></li>
                        </ul>
                        </li>
                    </ul>
                </div>
            </div>

            <div id="outline-container-sec-1" class="outline-2">
                <h2 id="sec-1"><span class="section-number-2">1</span> Hacked riak</h2>
                <div class="outline-text-2" id="text-1">
                    <p>
                        hack涉及到的riak组件有riak_kv, riak_api和riak_pb.
                    </p>

                    <p class="verse">
                        1. riak_kv<br  />
                        添加 riak_kv_pb_scan.erl,<br  />
                        riak_kv_scan_fsm.erl,<br  />
                        riak_kv_scan_core.erl,<br  />
                        riak_kv_scan_fsm_sup.erl,<br  />
                        <br  />
                        修改 riak_client.erl,<br  />
                        riak_kv_eleveldb_backend.erl,<br  />
                        riak_kv_sup.erl,<br  />
                        riak_kv_vnode.hrl,<br  />
                        riak_kv_vnode.erl<br  />
                        <br  />
                        2. riak_api<br  />
                        修改rebar.config, 替换riak_pb依赖为2.0.0_hack分支<br  />
                        <br  />
                        3. riak_pb<br  />
                        修改riak_kv.proto,<br  />
                        riak_pb_messages.csv<br  />
                    </p>
                </div>


                <div id="outline-container-sec-1-1" class="outline-3">
                    <h3 id="sec-1-1"><span class="section-number-3">1.1</span> Build</h3>
                    <div class="outline-text-3" id="text-1-1">
                        <div class="org-src-container">

                            <pre class="src src-sh">git clone ssh://gitlab@gitlab.widget-inc.com:65422/tiansheng.qin/riak.git

                            cd riak

                            git checkout 2.0.0_hack

                            make rel
                            </pre>
                        </div>
                    </div>
                </div>

                <div id="outline-container-sec-1-2" class="outline-3">
                    <h3 id="sec-1-2"><span class="section-number-3">1.2</span> Start</h3>
                    <div class="outline-text-3" id="text-1-2">
                        <div class="org-src-container">

                            <pre class="src src-sh"># start riak, create bucket-type of indexes, finally attach the riak
                            ./start
                            </pre>
                        </div>
                    </div>
                </div>

                <div id="outline-container-sec-1-3" class="outline-3">
                    <h3 id="sec-1-3"><span class="section-number-3">1.3</span> Test</h3>
                    <div class="outline-text-3" id="text-1-3">
                        <div class="org-src-container">

                            <pre class="src src-sh"># clone hacked riak
                            git clone ssh://gitlab@gitlab.widget-inc.com:65422/tiansheng.qin/riak-erlang-client.git

                            cd riak-erlang-client

                            make

                            # start eshell
                            erl -pa ebin deps/*/ebin
                            </pre>
                        </div>

                        <div class="org-src-container">

                            <pre class="src src-erlang">%% get Pid
                            {ok, Pid} = riakc_pb_socket:start_link("127.0.0.1", 8087).

                            %% update indexes bucket type
                            riakc_pb_socket:set_bucket_type(Pid, &lt;&lt;"indexes"&gt;&gt;, [{chash_keyfun, {chash_keyfun, chash_index_keyfun}}]).

                            %% inject data
                            Object1 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$1"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object1).

                            Object2 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$2"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object2).

                            Object3 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$3"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object3).

                            Object4 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$4"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object4).

                            Object5 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$5"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object5).

                            Object6 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$6"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object6).

                            Object7 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$7"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object7).

                            Object8 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$8"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object8).

                            Object9 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$9"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object9).

                            Object10 = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$10"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, Object10).

                            ObjectEnd = riakc_obj:new({&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins$$end"&gt;&gt;, &lt;&lt;&gt;&gt;),
                            riakc_pb_socket:put(Pid, ObjectEnd).

                            %% scan test
                            riakc_pb_socket:scan(Pid, {&lt;&lt;"indexes"&gt;&gt;, &lt;&lt;"indexes"&gt;&gt;}, &lt;&lt;"users:1:pins"&gt;&gt;, 0, 2, prev).

                            %% Result: {ok,["9","8"]}
                            </pre>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div id="postamble" class="status">
            <p class="author">Author: Tienson Qin</p>
            <p class="date">Created: 2014-10-28 Tue 11:46</p>
            <p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
            <p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
        </div>
    </body>
</html>
